app/Controllers/Auth.php

    public function loginProcess()
    {
        $model = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'se_manoel@hotmail.com'
 LIMIT 1

    public function registerProcess()
    {
        $model = new UserModel();

        // Regras de validação
        $validationRules = [
            'email' => 'required|valid_email|is_unique[users.email]', // Verifica se o e-mail é único
            'password' => 'required|min_length[6]', // Senha mínima de 6 caracteres
            'confirm_password' => 'required|matches[password]', // Confirmação de senha
        ];

        // Verificação das regras de validação
        if (!$this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('error', 'Por favor, corrija os erros abaixo.')
                ->with('validation', $this->validator); // Passa os erros de validação para a view
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Criptografa a senha
        $hashedPassword = password_hash($password, PASSWORD_BCRYPT);

        // Insere o usuário no banco de dados
        $model->insert([
            'email' => $email,
            'password' => $hashedPassword,
        ]);
---
INSERT INTO `users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('fsdfdsfsdfds@fdsfds.com.br', '$2y$10$a7j5nMLL1z.dbHydiTVxK.cnd.wdXONkRYKMiwlXZVtIf3ctZ2dT2', '2024-12-11 18:22:50', '2024-12-11 18:22:50')